views/reservations/detailDependentDropdown.php

        function(data){
        data = '<option value="">---choose</option>'+data;
        $('#reservation-id').html(data);
        }
    )

    ev.preventDefault();
});

    $(document).on('change','#reservation-id',function(ev){
    $(this).parents('form').submit();
    ev.preventDefault();
    });

EOT_JS
);

?>

<div class="customer-form">
  <?php $form = ActiveForm::begin(['enableAjaxValidation'=>false,'enableClientValidation'=>false,'options'=>['data-pjax'=>'']]); ?>
  <?php $customers = Customer::find()->all(); ?>
  <?= $form->field($model,'customer_id')->dropDownList(ArrayHelper::map($customers,'id','name','surname'),['prompt'=>'---choose']) ?>
  <?php $reservations = Reservation::findAll(['customer_id'=>$model->customer_id]); ?>
---
SELECT * FROM `customer`
SELECT * FROM `reservation` WHERE `customer_id` IS NULL